# Dataframes

In [3]:
import numpy as np
import pandas as pd

Los DataFrame son una estructura de datos bidimensional que admite columnas de diferentes tipos. Estan formados por filas y columnas. 
Su estreuctura puede ser considerada similar a una tabla sql

In [2]:
#Creaci√≥n de un dataframe a partir de un diccionario
d = {'col1': pd.Series([1., 2., 3., 4.]),
     'col2': pd.Series([4., 3., 2., 1.])}

#constructor de dataframes
df = pd.DataFrame(d)
df

   col1  col2
0   1.0   4.0
1   2.0   3.0
2   3.0   2.0
3   4.0   1.0

### Creacion de datadrame usando una lista de diccionarios

Podemos crear un dataframe a partir de una lista de diccionarios pasandole un index

In [4]:
l = [{'col1': 1, 'col2' : 4}, {'col1': 2, 'col2' : 3},  
     {'col1': 3, 'col2' : 2}, {'col1': 4, 'col2' : 1, 'col3' : 3}]

df = pd.DataFrame(l, index = ['a','b','c','e'])
df

   col1  col2  col3
a     1     4   NaN
b     2     3   NaN
c     3     2   NaN
e     4     1   3.0

Los dataframes al igual que las series pueden ser modificados.

In [5]:
#Para recuperar la columna podemos acerlo medianta el uso de [], de la misma manera que recuperamos un elemento de un array
df['col2']

a    4
b    3
c    2
e    1
Name: col2, dtype: int64

In [6]:
df['col4'] = df['col1'] + df['col2']
df

   col1  col2  col3  col4
a     1     4   NaN     5
b     2     3   NaN     5
c     3     2   NaN     5
e     4     1   3.0     5

In [7]:
#Podemos eliminar columnas con del
del df['col3']
df

   col1  col2  col4
a     1     4     5
b     2     3     5
c     3     2     5
e     4     1     5

In [9]:
#Tambien podemos insertar nuevas columnas, debemos pasar la posicion, el nombre de la columna y los datos
df.insert(0, 'col0', df['col4'] + df['col2'])
df

   col0  col1  col2  col4  col3
a     9     1     4     5     3
b     8     2     3     5     3
c     7     3     2     5     3
e     6     4     1     5     3

In [10]:
#Para acabar con esta lecci√≥n, tambi√©n deb√©is conocer el m√©todo assign, el cual nos permite crear una nueva columna en el dataframe
df = df.assign(col3 = 3)
df

   col0  col1  col2  col4  col3
a     9     1     4     5     3
b     8     2     3     5     3
c     7     3     2     5     3
e     6     4     1     5     3

# Lectura y Escritura

In [16]:
#Esta libreria nos sirve para establecer un path donde se encuentre el fichero que queremos leer
from pathlib import Path

data_path = Path('../data')

In [19]:
dataset = pd.read_csv('dataset.csv')
dataset.head() #head muestra los primeros registros, pero podriamos seleccionar los primeros dos regsitros con dataset.head(2)

   Number    City Gender  Age   Income Illness
0       1  Dallas   Male   41  40367.0      No
1       2  Dallas   Male   54  45084.0      No
2       3  Dallas   Male   42  52483.0      No
3       4  Dallas   Male   40  40941.0      No
4       5  Dallas   Male   46  50289.0      No